{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "input_dtype": "float32", "bias": true, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "input_dim": 9216, "trainable": true, "output_dim": 100, "activation": "linear", "name": "dense_33", "batch_input_shape": [null, 9216], "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_17", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": 100, "trainable": true, "output_dim": 30, "activation": "linear", "name": "dense_34", "W_constraint": null}}]}