{"config": [{"config": {"nb_col": 3, "W_regularizer": null, "input_dtype": "float32", "nb_filter": 32, "name": "convolution2d_1", "batch_input_shape": [null, 96, 96, 1], "init": "glorot_uniform", "border_mode": "valid", "nb_row": 3, "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 2, "W_regularizer": null, "nb_filter": 64, "name": "convolution2d_2", "init": "glorot_uniform", "border_mode": "valid", "nb_row": 2, "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 2, "W_regularizer": null, "nb_filter": 128, "name": "convolution2d_3", "init": "glorot_uniform", "border_mode": "valid", "nb_row": 2, "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_3", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "input_dim": null, "output_dim": 500, "name": "dense_1", "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "input_dim": null, "output_dim": 500, "name": "dense_2", "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "input_dim": null, "output_dim": 30, "name": "dense_3", "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}