{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_1", "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "nb_filter": 32, "nb_row": 3, "W_regularizer": null, "activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 96, 96, 1]}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "b_constraint": null, "nb_col": 2, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "nb_row": 2, "W_regularizer": null, "activity_regularizer": null, "nb_filter": 64, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "b_constraint": null, "nb_col": 2, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "nb_row": 2, "W_regularizer": null, "activity_regularizer": null, "nb_filter": 128, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "input_dim": null, "W_constraint": null, "output_dim": 500, "name": "dense_1", "W_regularizer": null, "activity_regularizer": null, "bias": true, "trainable": true, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "input_dim": null, "W_constraint": null, "output_dim": 500, "name": "dense_2", "W_regularizer": null, "activity_regularizer": null, "bias": true, "trainable": true, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "input_dim": null, "W_constraint": null, "output_dim": 30, "name": "dense_3", "W_regularizer": null, "activity_regularizer": null, "bias": true, "trainable": true, "activation": "linear", "init": "glorot_uniform"}}]}